---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures.CannotUnderstandAtLine
source: html/5356068e-9b8c-dc94-868b-59a6bda1c4e8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeFileFailures.CannotUnderstandAtLine Property

Cannot understand [EntryType] line '[Number]'

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotUnderstandAtLine { get; }
```